Revit 2027 API
EdgeEndPoint Constructor
 Constructs an instance of EdgeEndPoint.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public EdgeEndPoint(
	Edge edge,
	int index
)
Public Sub New (
	edge As Edge,
	index As Integer
)
public:
EdgeEndPoint(
	Edge^ edge,
	int index
)
new :
        edge : Edge *
        index : int -> EdgeEndPoint
Parameters
edge Edge
 The Edge.
index Int32
 Use 0 for the start point, 1 for the end point of an Edge.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
ArgumentOutOfRangeException |  The given value for index is not 0 or 1.
See Also
Reference
EdgeEndPoint Class
Autodesk.Revit.DB Namespace